export const BOT_MESSAGES = {
  NEW_USER_GREETING: 'Привітики! Я не сплю 😊',
  TASK_ADDED: 'Задачу поставила 🙂',
  COMMANDS_FOR_AI: {
    GENERATE_THEMES: 'Давай!',
    CREATE_CONTENT: 'Тема для огляду: ',
  },
  RESULT_FROM_SMM: '{assistant_name} пропонує такий список тем:\n\n',
  RESULT_FROM_HEAD:
    '{assistant_name} прийняла рішення розкрити дану тему 👇\n\n',
  ERROR: {
    PERMISSIONS: 'У доступі відмовлено! 🤣',
    CREATE_POST: 'Нажаль, пост не опубліковано ... трястя його матері 😤',
    SMM_MANAGER: '{assistant_name}, SMM манагер не впоралася 🤦',
    HEAD_OF_DEPARTMENT: '{assistant_name}, HEAD не змогла прийняти рішення 🤷',
    CONTENT_MANAGER:
      '{assistant_name}, Контент Менеджер не розкрила надану їй тему 🥲',
    CHIEF_EDITOR:
      '{assistant_name}, Головний редактор не змогла відредагувати пост 🤷',
    POST_WAS_NOT_ADDED: 'Пост не опубліковано! Дивися консольку 😔',
  },
  POST_MESSAGE:
    'Новий пост на тему {theme} опубліковано в каналі за даним {URL}',
  LOADER: '⏳',
};
